CallGirl-0.4.0/app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---

<p>There are currently <%= User.count %> users registered.</p>