CallGirl-0.4.0/app/controllers/projects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT "projects".* FROM "projects"
---
  def index
    @user = User.find(current_user)
    @search = @user.projects.search(params[:q])

INSERT INTO "projects" ("name", "description", "details", "projected_completion", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save