CallGirl-0.4.0/app/controllers/services_controller.rb

    def set_service
      @service = Service.find(params[:id])
---
SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", 0]]