CallGirl-0.4.0/app/controllers/servers_controller.rb

  def index
    #@servers = Server.all
    @user = User.find(current_user)
    @search = @user.servers.search(params[:q])
    @servers = @search.result.paginate(:page => params[:page], :per_page => 20)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "servers".* FROM "servers" WHERE "servers"."user_id" = ?  [["user_id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."user_id" = ? LIMIT 20 OFFSET 0  [["user_id", 1]]

  def show
    @user = User.find(current_user)
    @server = @user.servers.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."user_id" = ? AND "servers"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]

  def create
    @user = User.find(current_user)
    @server = Server.new(server_params)
    @user.servers << @server
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "servers" ("name", "username", "password", "privkey", "pubkey", "key", "ip", "hostname", "os", "configuration", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
  #  @user = User.find(current_user)
   # @server = @user.servers.find(params[:id])
    @user.save!

    respond_to do |format|
      if @server.update(server_params)
---
UPDATE "servers" SET "name" = ?, "username" = ?, "password" = ?, "privkey" = ?, "pubkey" = ?, "key" = ?, "ip" = ?, "hostname" = ?, "os" = ?, "configuration" = ?, "updated_at" = ? WHERE "servers"."id" = ?

    def set_server
   #   @server = Server.find(params[:id])
      @user = User.find(current_user)
      @server = @user.servers.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "servers".* FROM "servers" WHERE "servers"."user_id" = ? AND "servers"."id" = ? LIMIT 1  [["user_id", 1], ["id", 2]]